<template>
  <div class="change" id="change"></div>
</template>

<script>
import { onMounted, onUnmounted, ref } from "vue";
import { getImage } from "@/api";
export default {
  name: "ChangeBackgroundImage",
  setup() {
    var timer; //加载计时器

    onMounted(() => {
      /* 获取change元素，添加点击事件 */
      var ele = document.getElementById("change");
      ele.addEventListener("click", changeBackgroundImage);
    });
    /* 切换背景图片 */
    async function changeBackgroundImage() {
      /* 设置计时器，如果图片在60s类没有加载完，则可以继续加载下一张 */
      timer = null;
      timer = setTimeout(() => {
        loadImageSuccess();
      }, 60000);
      /* 加载图片中，移除点击事件 */
      var ele = document.getElementById("change");
      ele.removeEventListener("click", changeBackgroundImage);
      /* 加载背景图片时加载动画 */
      var load =
        '<svg t="1700976932479" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4233" width="50" height="50"><path d="M765.576 875.544c10.216 17.248 4.456 40.264-13.376 49.952a35.984 35.984 0 0 1-49.64-13.376c-10.72-17.232-4.472-39.728 12.784-49.936a36.984 36.984 0 0 1 50.232 13.36z m-215.72 77.968c0 19.904-16.472 36.576-37.16 36.576a36.672 36.672 0 0 1-36.576-36.576v-25.64a36.72 36.72 0 0 1 36.576-36.656c20.408 0 37.16 16.232 37.16 36.656v25.64z m-225.92-41.312a36.512 36.512 0 0 1-49.768 13.856l-0.48-0.264a36.328 36.328 0 0 1-13.576-50.248l27.232-47.64a37.648 37.648 0 0 1 50.736-13.584c17.248 10.208 23.568 32.992 13.072 50.24l-27.216 47.64zM148.672 764.168c-17.744 9.92-40.528 3.952-50.24-13.576-10.416-17.248-4.448-40.032 13.072-50.24l73.232-42.384c17.536-9.696 40.24-4.256 50.24 13.576 9.92 17.248 3.872 40.04-13.584 50.248l-72.72 42.376zM70.768 547.872a36.48 36.48 0 0 1-36.576-36.384v-0.192a36.56 36.56 0 0 1 36.256-36.864H184.8a36.48 36.48 0 0 1 36.576 36.384v0.192a36.552 36.552 0 0 1-36.224 36.864H70.768z m40.816-226.208c-17.824-9.92-23.568-32.416-13.072-49.952 9.696-17.744 32.416-23.792 50.24-13.584l123.888 71.936c17.536 9.984 23.28 32.4 13.584 49.728a36.96 36.96 0 0 1-50.16 13.584l-124.48-71.712z m148.528-175.2l86.304 149.824c10.496 17.536 32.992 23.776 50.448 13.36 17.536-9.92 23.28-32.688 13.072-50.224L323.344 109.888c-9.92-17.328-32.4-23.568-49.664-13.36a36.512 36.512 0 0 0-13.648 49.8l0.08 0.136z m216.016-77.392c0-19.904 16.736-36.864 36.576-36.864 20.408 0 37.16 16.528 37.16 36.864V241.68c0 20.4-16.472 36.864-37.16 37.152a36.752 36.752 0 0 1-36.576-36.928V69.072z m225.92 40.816a36.928 36.928 0 0 1 50.24-13.584 36.296 36.296 0 0 1 14.104 49.344l-0.512 0.896L679.36 296.368c-9.76 17.456-32.768 23.712-50.232 13.584-17.544-10.208-23.28-32.992-13.36-50.512l86.28-149.552z m175.784 148.24L727.696 344.656c-17.536 9.92-23.568 32.4-13.584 50.224a37.648 37.648 0 0 0 50.24 13.36l150.12-86.512a36.288 36.288 0 0 0 13.296-49.568l-0.232-0.384c-9.976-17.808-32.528-24.128-49.704-13.648z m77.096 216.304a36.208 36.208 0 0 1 36.568 36.864 36.344 36.344 0 0 1-36.128 36.576H782.112a36.96 36.96 0 0 1-36.656-36.864c0-20.112 16.752-36.576 36.656-36.576h172.816z" p-id="4234"></path></svg>';
      ele.style.backgroundImage = "url('data:image/svg+xml," + load + "')";
      setTimeout(() => {
        ele.style.transform = "rotate(100turn)";
        ele.style.transition = "100s";
      });
      /* 从后台获取图片 */
      getImage(1).then((res) => {
        if (res.data.code === 1) {
          var url = res.data.data[0].url;
          var x = new XMLHttpRequest();
          x.open("GET", url, true);
          x.onload = function () {
            if (flag.value == 1) {
              /* 图片加载完成，替换背景图片 */
              let bg = document.getElementById("index_bg");
              var a = "url(" + url + ")";
              bg.style.backgroundImage = a;
              loadImageSuccess();
            }
          };
          x.send();
        } else {
          loadImageSuccess();
        }
      });
    }
    function loadImageSuccess() {
      var ele = document.getElementById("change");
      ele.addEventListener("click", changeBackgroundImage);
      /* 图片加载完成，移除加载动画 */
      var b =
        '<svg t="1700975616313" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1112" width="50" height="50"><path d="M128.299 128C92.788 128 64 156.788 64 192.299v639.4C64 867.212 92.788 896 128.299 896H895.7c35.512 0 64.3-28.788 64.3-64.299V192.299C960 156.788 931.212 128 895.701 128H128.299zM128 588.313l178.162-178.162c24.795-24.795 64.996-24.795 89.792 0L817.803 832H128V588.313z m768 231.375L666.385 590.073l64.718-64.718c25.153-25.152 65.933-25.152 91.085 0L896 599.167v220.521zM694.65 471.299l-73.519 73.519L432.653 356.34c-45.064-45.064-118.127-45.064-163.19 0L128 497.803V192h768v316.657l-37.358-37.358c-45.286-45.285-118.707-45.285-163.992 0z" p-id="1113"></path></svg>';
      ele.style.backgroundImage = "url('data:image/svg+xml," + b + "')";
      ele.style.transform = "rotate(0turn)";
      ele.style.transition = "0s";
    }
    var flag = ref(1);
    onUnmounted(() => {
      clearTimeout(timer);
      flag.value = 0;
    });
    return {
      changeBackgroundImage,
    };
  },
};
</script>

<style scoped>
.change {
  background-image: url('data:image/svg+xml,<svg t="1700975616313" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1112" width="50" height="50"><path d="M128.299 128C92.788 128 64 156.788 64 192.299v639.4C64 867.212 92.788 896 128.299 896H895.7c35.512 0 64.3-28.788 64.3-64.299V192.299C960 156.788 931.212 128 895.701 128H128.299zM128 588.313l178.162-178.162c24.795-24.795 64.996-24.795 89.792 0L817.803 832H128V588.313z m768 231.375L666.385 590.073l64.718-64.718c25.153-25.152 65.933-25.152 91.085 0L896 599.167v220.521zM694.65 471.299l-73.519 73.519L432.653 356.34c-45.064-45.064-118.127-45.064-163.19 0L128 497.803V192h768v316.657l-37.358-37.358c-45.286-45.285-118.707-45.285-163.992 0z" p-id="1113"></path></svg>');
  height: 50px;
  width: 50px;
  user-select: none;
  opacity: 0.5;
}

.change:hover {
  opacity: 1;
}
</style>
